Revit 2027 API
StructuralWallUsage Enumeration
 Represents the structural usage of a wall.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StructuralWallUsage
Public Enumeration StructuralWallUsage
public enum class StructuralWallUsage
type StructuralWallUsage
Members
Member name | Value | Description
Bearing | 1 |  Structural usage is bearing.
Combined | 3 |  Structural usage is combined.
NonBearing | 0 |  Structural usage is non-bearing.
Shear | 2 |  Structural usage is shear.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace